In [1]:
import pandas as pd

In [7]:
## Series

series = pd.Series([1,2,3,4,5])
print(series)

dict = {"A":1,"B":2,"C":3,"D":4,"E":5}
s = pd.Series(dict)
print(s)

data = [10,20,30 ]
index = ["1","2","3"]
s = pd.Series(data,index)
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64
A    1
B    2
C    3
D    4
E    5
dtype: int64
1    10
2    20
3    30
dtype: int64

### DataFrame

In [20]:
dict =  {
    "Name": ["John", "Anna", "James", "Linda"],
    "Age": [28, 22, 35, 32],
    "City": ["New York", "Paris", "London", "Berlin"]
}
df  = pd.DataFrame(dict,index=[1,2,3,4])
print(df)

import numpy as np
np.array(df)

    Name  Age      City
1   John   28  New York
2   Anna   22     Paris
3  James   35    London
4  Linda   32    Berlin

array([['John', 28, 'New York'],
       ['Anna', 22, 'Paris'],
       ['James', 35, 'London'],
       ['Linda', 32, 'Berlin']], dtype=object)

In [35]:
data = [
    {"Name": "John", "Age": 28, "City": "New York"},
    {"Name": "Anna", "Age": 22, "City": "Paris"},
    {"Name": "James", "Age": 35, "City": "London"},
    {"Name": "Linda", "Age": 32, "City": "Berlin"},
]

data = pd.DataFrame(data,index=[1,2,3,4]) 
print(data)

    Name  Age      City
1   John   28  New York
2   Anna   22     Paris
3  James   35    London
4  Linda   32    Berlin

In [26]:
data1 = pd.read_csv("sales_data.csv")
data1.head()
# data1.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [30]:
# Accessing Data from df
data["Name"]

0     John
1     Anna
2    James
3    Linda
Name: Name, dtype: object

In [37]:
data.loc[1]

Name        John
Age           28
City    New York
Name: 1, dtype: object

In [38]:
data.iloc[0]

Name        John
Age           28
City    New York
Name: 1, dtype: object

In [45]:
## Accsing a Specific Element
data.at[2,"Age"]
#data.iat[2,1]

np.int64(22)

In [55]:
### Data Manipulation

print(data)
data["Salary"] = [10000,20000,30000,40000]
print(data)

data.drop("Salary",axis=1,inplace=True)
print(data)

data["Age"] += 1;
print(data)

    Name  Age      City
1   John   28  New York
2   Anna   22     Paris
3  James   35    London
4  Linda   32    Berlin
    Name  Age      City  Salary
1   John   28  New York   10000
2   Anna   22     Paris   20000
3  James   35    London   30000
4  Linda   32    Berlin   40000
    Name  Age      City
1   John   28  New York
2   Anna   22     Paris
3  James   35    London
4  Linda   32    Berlin
    Name  Age      City
1   John   29  New York
2   Anna   23     Paris
3  James   36    London
4  Linda   33    Berlin

In [56]:
data1 = pd.read_csv("sales_data.csv")
data1.head()

data1.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000